In [16]:
import pandas as pd
# 사용방법- pd.판다스명령

# 1. Series 실습

s1 = pd.Series({
    '김윤서':162,
    '한근영':158,
    '장재은':171
})
s1.name = '키'

s2 = pd.Series({
    '김윤서':100,
    '한근영':90,
    '장재은':75
})
s2.name = '국어'

print(s1,'\n', s2)

s3 = pd.Series([1,2,3,4])
print(s3)
s3

김윤서    162
한근영    158
장재은    171
Name: 키, dtype: int64
 김윤서    100
한근영     90
장재은     75
Name: 국어, dtype: int64
0    1
1    2
2    3
3    4
dtype: int64

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
# 2. DataFrame 실습

hi = pd.DataFrame({
    '출생지':['Korea','USA'],
    '나이':[20,30]
})
print(hi)
print("")
hi

     출생지  나이
0  Korea  20
1    USA  30

     출생지  나이
0  Korea  20
1    USA  30

In [19]:
# 데이터프레임 항목 추가하기
hi['성별']=['여','남']
# hi[추가할 column 내용] = [성별1, 성별2]
hi

     출생지  나이 성별
0  Korea  20  여
1    USA  30  남

In [23]:
# 데이터프레임 요소 추가하기 - loc[인덱스] = [내용1, 내용2, ]
hi.loc[2]=['Japan',25,'남']
hi

     출생지  나이 성별
0  Korea  20  여
1    USA  30  남
2  Japan  25  남

In [24]:
# 새로운 데이터프레임
hi2 = pd.DataFrame(s2) #기존 시리즈를 항목으로 추가할 수 있음
hi2['영어']=[10,20,30]
hi2['수학']=[95,50,80]
hi2

      국어  영어  수학
김윤서  100  10  95
한근영   90  20  50
장재은   75  30  80

In [26]:
# 원하는 column만 출력하기
hi2[['영어','수학']]

     영어  수학
김윤서  10  95
한근영  20  50
장재은  30  80

In [27]:
# 원하는 row만 출력하기
hi2.loc[['김윤서','장재은']]

      국어  영어  수학
김윤서  100  10  95
장재은   75  30  80

In [28]:
# row,column 합쳐서 선택
hi2.loc[['김윤서'],['영어','국어']]

     영어   국어
김윤서  10  100

In [32]:
# 요소 이용해 계산

hi2.sum()

국어    265
영어     60
수학    225
dtype: int64

In [33]:

hi2.mean()

국어    88.333333
영어    20.000000
수학    75.000000
dtype: float64

In [34]:
hi2.mean(axis=1)

김윤서    68.333333
한근영    53.333333
장재은    61.666667
dtype: float64

In [36]:
# 수학점수만 평균 내고 싶다?
hi2['수학'].mean() #print로 감싸지 않으면, 가장 아래 명령만 나옴

75.0

In [37]:
print(hi2['수학'].mean())

75.0

In [42]:
# 미션$1
print(hi2.loc[hi2['영어'] >= 10, '수학'].mean()) 

# hi2.loc[조건, 열의이름]
# hi2.loc[영어점수가 10점 이상인 사람의, '수학']
# 의 평균 (mean)

75.0